{
  "en": {
    "translation": {
      "home": "Home",
      "about": "About Us",
      "collection": "Collection",
      "contact": "Contacts",
      "en": "English",
      "ru": "Russian",
      "uz": "Uzbek",
      "ship": "Free shipping",
      "ship1": "Free shipping on all orders",
      "return": "Return Guarantee",
      "return1": "30 day money back",
      "sup1": "Online support 24/7",
      "sup2": "Technical support 24/7",
      "secure1": "Secure payment",
      "secure2": "All payment methods accepted",
      "quality": "Material quality",
      "natural": "Natural",
      "product": "Product",
      "des": "Has Been Company That Produces Cotton Fabrics For Use All Over The World For Many Years",
      "w-col": "Winter Collection",
      "s-col": "Spring Collection",
      "a-col": "Autumn Collection",
      "su-col": "Summer Collection",
      "des2": "**Health Benefits**: Quality Mattresses Promote Better Sleep Posture, Which Can Alleviate Back Pain And Improve Overall Health.",
      "menu": "Menu",
      "sub": "Subscribe To Our Email",
      "e-email": "Enter Your Email",
      "sub1": "Subscribe",
      "serach": "Search Here",
      "show": "Showing",
      "initial": "Initial sort",
      "popular": "Popularity",
      "ascending": "Price: Ascending",
      "descending": "Price: Descending",
      "tmatters": "Traditional Mattress: A Conventional Spring Mattress Covered With Soft Fabrics, Providing A Comfortable Sleep.",
      "omatters": "Orthopedic Mattress: A Mattress Specially Designed To Support The Back And Joints, Often Recommended By Doctors.",
      "mmatters": "Memory Foam Mattress: Made From Material That Conforms To The Shape Of The Body And Responds To Body Temperature, Reducing Pressure Points.",
      "lmatters": "Latex Mattress: Made From Natural Or Synthetic Latex, Featuring Hypoallergenic Properties And High Breathability.",
      "hmatters": "Hybrid Mattress: Combines Multiple Materials, Such As Springs And Memory Foam Or Latex, To Offer Diverse Benefits.",
      "gmatters": "Gel Infused Mattress: Made From Memory Foam Infused With Gel, Helping To Regulate Body Temperature.",
      "amatters": "Airbed Mattress: An Inflatable Mattress With Adjustable Firmness, Often Used For Travel Or Temporary Sleeping Arrangements.",
      "wmatters": "Waterbed Mattress: Filled With Water, Providing A Floating Effect And Excellent Support.",
      "fmatters": "Futon Mattress: Typically Foldable And Used As A Daytime Sofa, A Thin And Portable Mattress.",
      "imatters": "Innerspring Mattress: Features A Traditional Coil System, Offering Good Ventilation And Long-Lasting Durability.",
      "p-number": "Phone Number",
      "y-message": "Youre Message Here",
      "submit": "Submit",
      "email": "Email",
      "phone": "Phone",
      "address": "Address",
      "category": "Category",
      "winter": "winter",
      "summer": "summer",
      "autumn": "autumn",
      "spring": "spring",
      "name": "Name",
      "description": "Description",
      "review": "Reviews",
      "a-review": "Add a review",
      "p-email": "Your Email Adress Will Not Be Published. Required Fields Are Marked",
      "m-des": "Experience unparalleled comfort and support with our range of mattresses crafted with premium materials to ensure a restful night's sleep. From memory foam to hybrid designs, our mattresses are engineered to provide the perfect balance of softness and firmness, delivering the ultimate sleep experience for you and your loved ones."
    }
  },
  "uz": {
    "translation": {
      "home": "Bosh sahifa",
      "about": "Biz haqimizda",
      "collection": "Kolleksiya",
      "contact": "Aloqa",
      "en": "Inglizcha",
      "ru": "Ruscha",
      "uz": "Uzbekcha",
      "ship": "Bezorixlik",
      "ship1": "Barcha buyurtmalarga bepul yetkazib berish",
      "return": "Qaytarish kafolati",
      "return1": "30 kun pulni qaytarish",
      "sup1": "Onlayn qo'llab-quvvatlash 24/7",
      "sup2": "Texnik qo'llab-quvvatlash 24/7",
      "secure1": "Xavfsiz to'lov",
      "secure2": "Barcha to'lov usullari qabul qilinadi",
      "quality": "Material sifati",
      "natural": "Tabiiy",
      "product": "Mahsulot",
      "des": "Yillar davomida butun dunyoda ishlatiladigan paxta paxtasini ishlab chiqaruvchi kompaniya bo'ldi",
      "w-col": "Qish kolleksiyasi",
      "s-col": "Bahor kolleksiyasi",
      "a-col": "Kuz kolleksiyasi",
      "su-col": "Yoz kolleksiyasi",
      "des2": "**Sog'liq foydasi**: Sifatli duxobdan o'zingizning tinchlik o'rnatilmasiga yordam beradi, bu esa orqangalarni terishtiradi va umumiy sog'likni yaxshilaydi.",
      "menu": "Menyu",
      "sub": "Elektron pochta orqali obuna bo'lish",
      "e-email": "Elektron pochtaingizni kiriting",
      "sub1": "Obuna bo'lish",
      "serach": "Bu erda qidiruv",
      "show": "Ko'rsatilmoqda",
      "initial": "Boshlang'ich tuzatish",
      "popular": "Mashhurlik",
      "ascending": "Narx: Oshish",
      "descending": "Narx: Kamayish",
      "tmatters": "Odatiy Duxob: Odatiy o'lcha duxobi yumshoq paxta bilan qoplangan, qulay uxlashni ta'minlaydi.",
      "omatters": "Ortopedik Duxob: Ortib borayotgan va birgalikdagi qo'llashlarni qo'llaydigan, tebabetchilar tavsiya qiladi.",
      "mmatters": "Yaddascht Duxob: Tana shaklini qabul qiladigan materialdan ishlangan, va tana haroratiga javob beradi, bosqichlarni kamaytiradi.",
      "lmatters": "Lateks Duxob: Tabiiy yoki sintetik lateksdan ishlangan, gipoallergenik xususiyatlar va yuqori nafas olish tufayli.",
      "hmatters": "Gibrid Duxob: Yaddascht va yoki lateks bilan yayilgan o'lchovlar kabi, ko'plab foydalanishni taklif qiladi.",
      "gmatters": "Jel shaklida Duxob: Jel bilan ishlangan yaddascht duxob, tana haroratini tartibga soladi.",
      "amatters": "Havo Duxob: Haroratni o'zgartirib bo'lmaydigan qo'llanmadan ishlab chiqarilgan xalqaro duxob, sayohat yoki vaqtincha o'rinlash uchun mashhur.",
      "wmatters": "Suv Duxobi: Suv bilan to'ldirilgan, flotatsiyani ta'minlaydi va yaxshi qo'llashni ta'minlaydi.",
      "fmatters": "Futon Duxob: Odatda qaytariladigan va kun davomida divan sifatida ishlatiladi, yengil va portativ duxob.",
      "imatters": "Ichki O'lcha Duxob: Odatiy spiral tizimi bilan ta'minlanadi, yaxshi ventilatsiya va uzun muddatli to'liqlik.",
      "p-number": "Telefon raqami",
      "y-message": "Sizning habaringiz",
      "submit": "Yuborish",
      "email": "Elektron pochta",
      "phone": "Telefon",
      "address": "Manzil",
      "category": "Tur",
      "winter": "qish",
      "summer": "yoz",
      "autumn": "kuz",
      "spring": "bahor",
      "name": "Ism",
      "description": "Tavsif",
      "review": "Tahlil",
      "a-review": "Tahlil qo'shish",
      "p-email": "Sizning elektron pochta manzilingiz chop etilmaydi. Majburiy maydonlar belgilangan",
      "m-des": "Ko'rsatkichsiz mukammal xudlik va qo'llab-quvvat bilan tanlagan yaddasht duxoblarimiz seriyalari sizni va sevganlaringiz uchun eng yaxshi tunuk xususiyatlar bilan tayyorlangan, sifatli materiallardan ishlangan. Yaddascht va gibrid dizaynlardan yodlab, duxoblarimiz yumshoqlik va o'sushni qat'iy nazorat qilish uchun yaratilgan va siz va sevganlaringiz uchun eng yaxshi tunuk tajribani taqdim etish maqsadida yaratilgan."
    }
  },
  "ru":{
    "translation":{
        "home": "Главная",
        "about": "О нас",
        "collection": "Коллекция",
        "contact": "Контакты",
        "en": "Английский",
        "ru": "Русский",
        "uz": "Узбекский",
        "ship": "Бесплатная доставка",
        "ship1": "Бесплатная доставка для всех заказов",
        "return": "Гарантия возврата",
        "return1": "Возврат средств в течение 30 дней",
        "sup1": "Онлайн поддержка 24/7",
        "sup2": "Техническая поддержка 24/7",
        "secure1": "Безопасная оплата",
        "secure2": "Принимаются все способы оплаты",
        "quality": "Качество материала",
        "natural": "Натуральный",
        "product": "Продукт",
        "des": "Компания, производящая хлопковые ткани для использования по всему миру на протяжении многих лет",
        "w-col": "Зимняя коллекция",
        "s-col": "Весенняя коллекция",
        "a-col": "Осенняя коллекция",
        "su-col": "Летняя коллекция",
        "des2": "**Польза для здоровья**: Качественные матрасы способствуют лучшей осанке во сне, что может облегчить боль в спине и улучшить общее здоровье.",
        "menu": "Меню",
        "sub": "Подписаться на нашу рассылку",
        "e-email": "Введите ваш email",
        "sub1": "Подписаться",
        "serach": "Искать здесь",
        "show": "Показано",
        "initial": "Первоначальная сортировка",
        "popular": "Популярность",
        "ascending": "Цена: по возрастанию",
        "descending": "Цена: по убыванию",
        "tmatters": "Традиционный матрас: обычный пружинный матрас, покрытый мягкими тканями, обеспечивающий комфортный сон.",
        "omatters": "Ортопедический матрас: матрас, специально разработанный для поддержки спины и суставов, часто рекомендуемый врачами.",
        "mmatters": "Матрас из памяти: изготовлен из материала, который принимает форму тела и реагирует на температуру тела, уменьшая точки давления.",
        "lmatters": "Латексный матрас: изготовлен из натурального или синтетического латекса, обладает гипоаллергенными свойствами и высокой воздухопроницаемостью.",
        "hmatters": "Гибридный матрас: комбинирует несколько материалов, таких как пружины и память или латекс, чтобы предложить разнообразные преимущества.",
        "gmatters": "Матрас с гелем: изготовлен из памяти пены, пропитанной гелем, что помогает регулировать температуру тела.",
        "amatters": "Надувной матрас: надувной матрас с регулируемой жесткостью, часто используется для путешествий или временных спальных мест.",
        "wmatters": "Водяной матрас: наполнен водой, обеспечивает эффект плавания и отличную поддержку.",
        "fmatters": "Футонный матрас: обычно складной и используется в качестве дневного дивана, тонкий и портативный матрас.",
        "imatters": "Пружинный матрас: имеет традиционную систему пружин, обеспечивающую хорошую вентиляцию и долговечность.",
        "p-number": "Номер телефона",
        "y-message": "Ваше сообщение здесь",
        "submit": "Отправить",
        "email": "Электронная почта",
        "phone": "Телефон",
        "address": "Адрес",
        "category": "Категория",
        "winter": "зима",
        "summer": "лето",
        "autumn": "осень",
        "spring": "весна",
        "name": "Имя",
        "description": "Описание",
        "review": "Отзывы",
        "a-review": "Добавить отзыв",
        "p-email": "Ваш адрес электронной почты не будет опубликован. Обязательные поля помечены",
        "m-des": "Ощутите непревзойденный комфорт и поддержку благодаря нашему ассортименту матрасов, изготовленных из высококачественных материалов для обеспечения спокойного сна. Наши матрасы, начиная от пены с памятью до гибридных конструкций, разработаны для обеспечения идеального баланса мягкости и упругости, обеспечивая вам и вашим близким идеальный опыт сна."
  
    }
  }
}
